# organization-shared - staging
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

module.common_resources.module.kafka_deadletter_topic.data.aws_ssm_parameter.cluster_id: Reading...
module.common_resources.module.kafka_topic.data.aws_ssm_parameter.cluster_id: Reading...
module.common_resources.module.kafka_retry_topic[0].data.aws_ssm_parameter.cluster_id: Reading...
module.common_resources.module.database.data.aws_ssm_parameter.cluster_id: Reading...
module.common_resources.module.kafka_deadletter_topic.data.aws_ssm_parameter.cluster_id: Read complete after 0s [id=upstash_kafka_cluster_id]
module.common_resources.module.kafka_deadletter_topic.upstash_kafka_topic.default: Refreshing state... [id=upstash-kafka-topic-12ccd22d-c5d8-47cb-abbc-990510dfc69b]
module.common_resources.module.kafka_topic.data.aws_ssm_parameter.cluster_id: Read complete after 1s [id=upstash_kafka_cluster_id]
module.common_resources.module.database.data.aws_ssm_parameter.cluster_id: Read complete after 1s [id=cockroachdb_serverless_cluster_id]
module.common_resources.module.database.cockroach_database.default: Refreshing state... [id=89aed7d6-74bd-48f1-b647-6af2544ab965:organization]
module.common_resources.module.kafka_topic.upstash_kafka_topic.default: Refreshing state... [id=upstash-kafka-topic-5409f2f6-ddaa-425e-b8cc-3e73904ff43c]
module.common_resources.module.kafka_retry_topic[0].data.aws_ssm_parameter.cluster_id: Read complete after 1s [id=upstash_kafka_cluster_id]
module.common_resources.module.kafka_retry_topic[0].upstash_kafka_topic.default: Refreshing state... [id=upstash-kafka-topic-bd4fa938-d38e-4311-891d-4b8f71ebda48]
module.common_resources.module.database_migration_user.data.aws_ssm_parameter.cluster_id: Reading...
module.common_resources.module.database_migration_user.random_password.password: Refreshing state... [id=none]
module.common_resources.module.database_migration_user.data.aws_ssm_parameter.cluster_id: Read complete after 0s [id=cockroachdb_serverless_cluster_id]
module.common_resources.module.database_migration_user.cockroach_sql_user.default: Refreshing state... [id=89aed7d6-74bd-48f1-b647-6af2544ab965:organization_database_migration]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.common_resources.module.database_migration_user.data.cockroach_connection_string.default will be read during apply
  # (config refers to values not yet known)
 <= data "cockroach_connection_string" "default" {
      + connection_params = (known after apply)
      + connection_string = (known after apply)
      + database          = "organization"
      + id                = (sensitive value)
      + os                = (known after apply)
      + password          = (sensitive value)
      + sql_user          = "organization_database_migration"
    }

  # module.common_resources.module.database_migration_user.cockroach_sql_user.default will be updated in-place
  ~ resource "cockroach_sql_user" "default" {
        id         = "89aed7d6-74bd-48f1-b647-6af2544ab965:organization_database_migration"
        name       = "organization_database_migration"
      ~ password   = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.common_resources.module.database_migration_user.random_password.password must be replaced
-/+ resource "random_password" "password" {
      ~ bcrypt_hash      = (sensitive value)
      ~ id               = "none" -> (known after apply)
      ~ keepers          = { # forces replacement
          ~ "random_seed" = "1f74f5ae-a707-4f37-b855-dfb08657fc8d" -> "81fd6372-b40d-4125-891e-d71086006da7"
        }
      ~ result           = (sensitive value)
        # (11 unchanged attributes hidden)
    }

  # module.common_resources.module.kafka_deadletter_topic.upstash_kafka_topic.default must be replaced
-/+ resource "upstash_kafka_topic" "default" {
      ~ creation_time    = 1684987349 -> (known after apply)
      ~ id               = "upstash-kafka-topic-12ccd22d-c5d8-47cb-abbc-990510dfc69b" -> (known after apply)
      ~ multizone        = false -> (known after apply)
      ~ partitions       = 3 -> 1 # forces replacement
      ~ password         = (sensitive value)
      ~ region           = "us-east-1" -> (known after apply)
      ~ rest_endpoint    = "striking-caiman-7501-us1-rest-kafka.upstash.io" -> (known after apply)
      ~ state            = "active" -> (known after apply)
      ~ tcp_endpoint     = "striking-caiman-7501-us1-kafka.upstash.io" -> (known after apply)
      ~ topic_id         = "12ccd22d-c5d8-47cb-abbc-990510dfc69b" -> (known after apply)
      ~ username         = "c3RyaWtpbmctY2FpbWFuLTc1MDEkI0DWKWf3IZw7VB-njMGzLuj1ndNLjK29FUM" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.common_resources.module.kafka_retry_topic[0].upstash_kafka_topic.default must be replaced
-/+ resource "upstash_kafka_topic" "default" {
      ~ creation_time    = 1684987349 -> (known after apply)
      ~ id               = "upstash-kafka-topic-bd4fa938-d38e-4311-891d-4b8f71ebda48" -> (known after apply)
      ~ multizone        = false -> (known after apply)
      ~ partitions       = 3 -> 2 # forces replacement
      ~ password         = (sensitive value)
      ~ region           = "us-east-1" -> (known after apply)
      ~ rest_endpoint    = "striking-caiman-7501-us1-rest-kafka.upstash.io" -> (known after apply)
      ~ state            = "active" -> (known after apply)
      ~ tcp_endpoint     = "striking-caiman-7501-us1-kafka.upstash.io" -> (known after apply)
      ~ topic_id         = "bd4fa938-d38e-4311-891d-4b8f71ebda48" -> (known after apply)
      ~ username         = "c3RyaWtpbmctY2FpbWFuLTc1MDEkI0DWKWf3IZw7VB-njMGzLuj1ndNLjK29FUM" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

Plan: 3 to add, 1 to change, 3 to destroy.

Changes to Outputs:
  ~ database_migration_user_connection_string = (sensitive value)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*